#!/usr/bin/env python
# -*- coding:utf-8 -*-
# @Time      : 2017/12/28 11:38
# @Author    : zhouyuyao
# @File      : waterflower.py


# 2. 打印出所有的“水仙花数”,所谓“水仙花数”是指一个三位数,其各位数字立方和等于该数本身。
# 例如：153是一个“水仙花数”,因为153=1的三次方＋5的三次方＋3的三次方。
# 程序分析：利用for循环控制100-999个数,每个数分解出个位,十位,百位。
# print(145//100)
# print(145/100)

for m in range(100,1000):
    i = m // 100            #百位
    v = m // 10 % 10        #十位
    h = m % 10              #个位
    if m ==i**3+v**3+h**3:
        print("{0} ** 3 + {1} ** 3 + {2} ** 3 = {3}".format(i,v,h,m))
